// governorates.js
const admins = {
  cairo: [
    "إدارة وسط القاهرة",
    "إدارة شرق القاهرة",
    "إدارة غرب القاهرة",
    "إدارة شبرا",
    "إدارة المرج",
    "إدارة المطرية",
    "إدارة عين شمس",
    "إدارة مدينة نصر",
    "إدارة السلام",
    "إدارة المعادي",
    "إدارة حلوان",
    "إدارة البساتين",
    "إدارة دار السلام"
  ],
  giza: [
    "إدارة شمال الجيزة",
    "إدارة جنوب الجيزة",
    "إدارة الدقي",
    "إدارة العجوزة",
    "إدارة بولاق الدكرور",
    "إدارة الهرم",
    "إدارة 6 أكتوبر",
    "إدارة الشيخ زايد",
    "إدارة الحوامدية",
    "إدارة البدرشين",
    "إدارة الصف",
    "إدارة أطفيح",
    "إدارة العياط"
  ],
  alex: [
    "إدارة شرق الإسكندرية",
    "إدارة غرب الإسكندرية",
    "إدارة وسط الإسكندرية",
    "إدارة العامرية",
    "إدارة برج العرب"
  ],
  qalyubia: [
    "إدارة بنها",
    "إدارة قليوب",
    "إدارة شبرا الخيمة",
    "إدارة القناطر الخيرية",
    "إدارة الخانكة",
    "إدارة كفر شكر",
    "إدارة طوخ",
    "إدارة شبين القناطر"
  ],
  sharqia: [
    "إدارة الزقازيق",
    "إدارة بلبيس",
    "إدارة أبو حماد",
    "إدارة أبو كبير",
    "إدارة منيا القمح",
    "إدارة كفر صقر",
    "إدارة أولاد صقر",
    "إدارة ديرب نجم",
    "إدارة ههيا",
    "إدارة العاشر من رمضان",
    "إدارة الإبراهيمية",
    "إدارة فاقوس",
    "إدارة القرين",
    "إدارة الحسينية",
    "إدارة صان الحجر"
  ],
  dakahlia: [
    "إدارة المنصورة",
    "إدارة طلخا",
    "إدارة ميت غمر",
    "إدارة السنبلاوين",
    "إدارة بلقاس",
    "إدارة الجمالية",
    "إدارة دكرنس",
    "إدارة بني عبيد",
    "إدارة المطرية",
    "إدارة شربين",
    "إدارة أجا",
    "إدارة الكردي",
    "إدارة منية النصر",
    "إدارة ميت سلسيل",
    "إدارة محلة دمنة"
  ],
  menoufia: [
    "إدارة شبين الكوم",
    "إدارة منوف",
    "إدارة سرس الليان",
    "إدارة بركة السبع",
    "إدارة الباجور",
    "إدارة أشمون",
    "إدارة تلا",
    "إدارة الشهداء"
  ],
  gharbia: [
    "إدارة طنطا",
    "إدارة المحلة الكبرى",
    "إدارة سمنود",
    "إدارة زفتى",
    "إدارة كفر الزيات",
    "إدارة قطور",
    "إدارة بسيون"
  ],
  kafrElsheikh: [
    "إدارة كفر الشيخ",
    "إدارة دسوق",
    "إدارة فوه",
    "إدارة قلين",
    "إدارة سيدي سالم",
    "إدارة الحامول",
    "إدارة مطوبس",
    "إدارة بيلا"
  ],
  beniSuef: [
    "إدارة بني سويف",
    "إدارة الواسطى",
    "إدارة ناصر",
    "إدارة إهناسيا",
    "إدارة ببا",
    "إدارة سمسطا",
    "إدارة الفشن"
  ],
  minya: [
    "إدارة المنيا",
    "إدارة بني مزار",
    "إدارة مطاي",
    "إدارة سمالوط",
    "إدارة ملوي",
    "إدارة أبو قرقاص",
    "إدارة العدوة",
    "إدارة دير مواس"
  ],
  assiut: [
    "إدارة أسيوط",
    "إدارة الفتح",
    "إدارة القوصية",
    "إدارة ديروط",
    "إدارة البداري",
    "إدارة منفلوط",
    "إدارة أبنوب",
    "إدارة صدفا",
    "إدارة الغنايم"
  ],
  sohag: [
    "إدارة سوهاج",
    "إدارة أخميم",
    "إدارة جرجا",
    "إدارة البلينا",
    "إدارة المنشأة",
    "إدارة دار السلام",
    "إدارة المراغة",
    "إدارة طهطا",
    "إدارة طما"
  ],
  qena: [
    "إدارة قنا",
    "إدارة أبو تشت",
    "إدارة فرشوط",
    "إدارة نجع حمادي",
    "إدارة الوقف",
    "إدارة دشنا",
    "إدارة قفط",
    "إدارة قوص",
    "إدارة نقادة"
  ],
  luxor: [
    "إدارة الأقصر",
    "إدارة القرنة",
    "إدارة أرمنت",
    "إدارة إسنا",
    "إدارة الطود",
    "إدارة البياضية"
  ],
  aswan: [
    "إدارة أسوان",
    "إدارة دراو",
    "إدارة كوم أمبو",
    "إدارة نصر النوبة",
    "إدارة إدفو"
  ],
  redSea: [
    "إدارة الغردقة",
    "إدارة رأس غارب",
    "إدارة سفاجا",
    "إدارة القصير",
    "إدارة مرسى علم",
    "إدارة شلاتين",
    "إدارة حلايب"
  ],
  matrouh: [
    "إدارة مرسى مطروح",
    "إدارة الحمام",
    "إدارة العلمين",
    "إدارة الضبعة",
    "إدارة النجيلة",
    "إدارة سيدي براني",
    "إدارة السلوم",
    "إدارة سيوة"
  ],
  newValley: [
    "إدارة الخارجة",
    "إدارة الداخلة",
    "إدارة الفرافرة",
    "إدارة باريس",
    "إدارة بلاط"
  ],
  northSinai: [
    "إدارة العريش",
    "إدارة الشيخ زويد",
    "إدارة رفح",
    "إدارة الحسنة",
    "إدارة نخل"
  ],
  southSinai: [
    "إدارة الطور",
    "إدارة شرم الشيخ",
    "إدارة دهب",
    "إدارة نويبع",
    "إدارة طابا",
    "إدارة سانت كاترين"
  ]
};

